import pandas as pd
from classes.tools import BackTool


class Parser:
    def __init__(self):
        self.schedule = pd.read_excel(r'files/ipz_schedule.xlsx').values.tolist()
        self.teachers = pd.read_excel(r'files/prep_info.xlsx').values.tolist()

    def parse(self, shift):
        groups_schedule = {}

        for i in range(len(self.schedule[0]) - 2):
            groups_schedule[self.schedule[0][i + 2]] = {
                "Понеділок": {'09:00-10:20': {"Пара": 'nan', "Аудиторія": 'nan'},
                              '10:30-11:50': {"Пара": 'nan', "Аудиторія": 'nan'},
                              '12:10-13:30': {"Пара": 'nan', "Аудиторія": 'nan'},
                              '13:40-15:00': {"Пара": 'nan', "Аудиторія": 'nan'},
                              '15:10-16:30': {"Пара": 'nan', "Аудиторія": 'nan'},
                              '16:40-18:00': {"Пара": 'nan', "Аудиторія": 'nan'},
                              '18:10-19:30': {"Пара": 'nan', "Аудиторія": 'nan'}},
                "Вівторок": {'09:00-10:20': {"Пара": 'nan', "Аудиторія": 'nan'},
                             '10:30-11:50': {"Пара": 'nan', "Аудиторія": 'nan'},
                             '12:10-13:30': {"Пара": 'nan', "Аудиторія": 'nan'},
                             '13:40-15:00': {"Пара": 'nan', "Аудиторія": 'nan'},
                             '15:10-16:30': {"Пара": 'nan', "Аудиторія": 'nan'},
                             '16:40-18:00': {"Пара": 'nan', "Аудиторія": 'nan'},
                             '18:10-19:30': {"Пара": 'nan', "Аудиторія": 'nan'}},
                "Середа": {'09:00-10:20': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '10:30-11:50': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '12:10-13:30': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '13:40-15:00': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '15:10-16:30': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '16:40-18:00': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '18:10-19:30': {"Пара": 'nan', "Аудиторія": 'nan'}},
                "Четвер": {'09:00-10:20': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '10:30-11:50': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '12:10-13:30': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '13:40-15:00': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '15:10-16:30': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '16:40-18:00': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '18:10-19:30': {"Пара": 'nan', "Аудиторія": 'nan'}},
                "П'ятниця": {'09:00-10:20': {"Пара": 'nan', "Аудиторія": 'nan'},
                             '10:30-11:50': {"Пара": 'nan', "Аудиторія": 'nan'},
                             '12:10-13:30': {"Пара": 'nan', "Аудиторія": 'nan'},
                             '13:40-15:00': {"Пара": 'nan', "Аудиторія": 'nan'},
                             '15:10-16:30': {"Пара": 'nan', "Аудиторія": 'nan'},
                             '16:40-18:00': {"Пара": 'nan', "Аудиторія": 'nan'},
                             '18:10-19:30': {"Пара": 'nan', "Аудиторія": 'nan'}},
                "Субота": {'09:00-10:20': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '10:30-11:50': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '12:10-13:30': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '13:40-15:00': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '15:10-16:30': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '16:40-18:00': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '18:10-19:30': {"Пара": 'nan', "Аудиторія": 'nan'}},
                "Неділя": {'09:00-10:20': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '10:30-11:50': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '12:10-13:30': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '13:40-15:00': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '15:10-16:30': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '16:40-18:00': {"Пара": 'nan', "Аудиторія": 'nan'},
                           '18:10-19:30': {"Пара": 'nan', "Аудиторія": 'nan'}}}

        wkofs = BackTool.week_of_study(shift)
        if str(wkofs % 2) == '1':
            n = 3
        else:
            n = 1

        for i in range(n, len(self.schedule) - 1, 4):
            objects = self.schedule[i]
            links = self.schedule[i + 1]

            k = 2
            for key in groups_schedule:
                groups_schedule[key][objects[0]][objects[1]]["Пара"] = objects[k]
                groups_schedule[key][objects[0]][objects[1]]["Аудиторія"] = links[k]
                k += 1

        return groups_schedule  # Має вигляд { 'Назва групи': { 'День': {'Період': {'Пара': str, 'Аудиторія': str}}}

    def prep_parse(self):
        return self.teachers
